backend/controllers/GameController.php

    public function actionUpdate($id)
    {
        if (!Yii::$app->user->can('updateGame')) {
            throw new \yii\web\ForbiddenHttpException('You are not allowed to perform this action.');
        }
        $model = $this->findModel($id);
        $model->genreIds = array_map(fn($genre) => $genre->id, $model->genres);
        $model->platformIds = array_map(fn($platform) => $platform->id, $model->platforms);

        if ($this->request->isPost) {
            if ($model->load($this->request->post())) {
---
SELECT * FROM `game_genre` WHERE `game_id`=6
SELECT * FROM `genres` WHERE `id` IN (1, 2)
SELECT * FROM `game_platform` WHERE `game_id`=6
SELECT * FROM `platforms` WHERE 0=1

    protected function findModel($id)
    {
        if (($model = Games::findOne(['id' => $id])) !== null) {
---
SELECT * FROM `games` WHERE `id`='6'