backend/controllers/GameController.php

SELECT * FROM `game_genre` WHERE `game_id`=49
SELECT * FROM `game_platform` WHERE `game_id`=49
---
    public function actionUpdate($id)
    {
        if (!Yii::$app->user->can('updateGame')) {
            throw new \yii\web\ForbiddenHttpException('You are not allowed to perform this action.');
        }
        $model = $this->findModel($id);
        $model->genreIds = array_map(fn($genre) => $genre->id, $model->genres);
        $model->platformIds = array_map(fn($platform) => $platform->id, $model->platforms);

        $existingCoverPath = $model->cover_path;

        if ($model->load(Yii::$app->request->post())) {

DELETE FROM `games` WHERE `id`=48
---
                ->exists();

            if ($exists) {
                $db->createCommand()
                    ->delete($teamlist, ['games_id' => $id])
                    ->execute();

SELECT * FROM `games` WHERE `id`='49'
---
    protected function findModel($id)
    {
        if (($model = Games::findOne(['id' => $id])) !== null) {