backend/controllers/PlatformController.php

SELECT * FROM `platforms` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Platforms::findOne(['id' => $id])) !== null) {