backend/controllers/TeamListController.php

SELECT `id` FROM `games` WHERE `id` IN (6, 7, 33, 34, 35, 40, 42)
---
    public function actionAddGames($id)
    {
        $model = $this->findModel($id);

        $searchModel = new GameSearch();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);

        $alreadyAddedGames = $model->getGames()->select('id')->column();

        if (Yii::$app->request->isPost) {
            $selectedGames = Yii::$app->request->post('selection', []); // IDs of selected games
            foreach ($selectedGames as $gameId) {
                $game = Games::findOne($gameId);

SELECT * FROM `team_lists` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = TeamLists::findOne(['id' => $id])) !== null) {