frontend/controllers/CartController.php

SELECT `g`.*, `c`.`quantity`, `c`.`id` AS `cart_id` FROM `games` `g` INNER JOIN `cart` `c` ON c.game_id = g.id WHERE `c`.`profile_id`=1
---
    public function actionIndex()
    {
        $profileId = Yii::$app->user->identity->profile->id; // Adjust as necessary
        $games = (new \yii\db\Query())
            ->select(['g.*', 'c.quantity', 'c.id AS cart_id'])
            ->from('games g')
            ->innerJoin('cart c', 'c.game_id = g.id')
            ->where(['c.profile_id' => $profileId])
            ->all();

DELETE FROM `cart` WHERE `id`='60'
---
    public function actionRemove()
    {
        $request = Yii::$app->request;

        if ($request->isPost) {
            $cartId = $request->post('cartId');

            if ($cartId) {
                $rowsDeleted = Yii::$app->db->createCommand()
                    ->delete('cart', ['id' => $cartId])
                    ->execute();