frontend/controllers/GameController.php

    public function actionByGenre($id)
    {
        $genre = Genres::findOne($id);
---
SELECT * FROM `game_genre` WHERE `genre_id`=5
SELECT * FROM `genres` WHERE `id`='5'