frontend/controllers/GameController.php

SELECT * FROM `games` WHERE `id`='6'
---
    public function actionView($id)
    {
        $model = Games::findOne($id);

SELECT * FROM `games` WHERE `id`='7'
---
    protected function findModel($id)
    {
        if (($model = Games::findOne(['id' => $id])) !== null) {