frontend/controllers/ProfileController.php

    protected function findModel($id)
    {
        $model = Profiles::find()->with('user')->where(['id' => $id])->one();
---
SELECT * FROM `profiles` WHERE `id`='1'
SELECT * FROM `user` WHERE `id`=1