frontend/controllers/SiteController.php

    public function actionIndex()
    {
        $teamLists = \common\models\TeamLists::find()
            ->with('games')
            ->all();
---
SELECT * FROM `game_team_lists` WHERE `team_lists_id` IN (1, 2)
SELECT * FROM `games` WHERE `id` IN (6, 7, 33, 34, 35, 36, 37, 40, 41, 42, 43)
SELECT * FROM `team_lists`