common/models/Games.php

    public function linkGenres($genreIds)
    {
        // Clear existing genres
        $this->unlinkAll('genres', true);

        // Link new genres
        if (!empty($genreIds)) {
            foreach ($genreIds as $genreId) {
                $genre = Genres::findOne($genreId);
---
SELECT * FROM `genres` WHERE `id`='1'

    public function linkPlatforms($platformIds)
    {
        // Clear existing platforms
        $this->unlinkAll('platforms', true);

        // Link new platforms
        if (!empty($platformIds)) {
            foreach ($platformIds as $platformId) {
                $platform = Platforms::findOne($platformId);
---
SELECT * FROM `platforms` WHERE `id`='5'