common/models/Reviews.php

    public function getHelpfulCount()
    {
        return HelpfulReviews::find()->where(['review_id' => $this->id])->count();
---
SELECT COUNT(*) FROM `helpful_reviews` WHERE `review_id`=4

    public function getUnhelpfulCount()
    {
        return UnhelpfulReviews::find()->where(['review_id' => $this->id])->count();
---
SELECT COUNT(*) FROM `unhelpful_reviews` WHERE `review_id`=4