frontend/views/layouts/main.php

SELECT * FROM `profiles` WHERE `user_id`=1
SELECT `id`, `name` FROM `genres` ORDER BY `name`
SELECT `id`, `name` FROM `platforms` ORDER BY `name`
---
use yii\bootstrap5\BootstrapAsset;

$user = Yii::$app->user->identity;
$profile = $user ? Profiles::findOne(['user_id' => $user->id]) : null;
$genres = Genres::find()->select(['id', 'name'])->orderBy('name')->all();
$platforms = Platforms::find()->select(['id', 'name'])->orderBy('name')->all();