backend/views/game/_form.php

SELECT * FROM `genres`
SELECT * FROM `platforms`
---
    <?= $form->field($model, 'price')->textInput() ?>

    <h3>Genres</h3>
    <?= $form->field($model, 'genreIds')->checkboxList(
        ArrayHelper::map(Genres::find()->all(), 'id', 'name'),
        ['separator' => '<br>']
    )->label(false) ?>

    <h3>Platforms</h3>
    <?= $form->field($model, 'platformIds')->checkboxList(
        ArrayHelper::map(Platforms::find()->all(), 'id', 'name'),
        ['separator' => '<br>']
    )->label(false) ?>